loadtest/artillery/loadtest.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://externalapi.calmhill-47414f9f.swedencentral.azurecontainerapps.io
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 300
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
          - get:
              url: '/id'
        count: 100